---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZJust
source: html/042f6a1b-2f18-9ddf-0924-06b791a4f570.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.ZJust Property

Z justification (ref axis).

## Syntax (C#)
```csharp
public ZJustification ZJust { get; }
```